Number of classes: 19 
Max length label: 8
90000 training examples
10000 test examples
20 epochs
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
the_input (InputLayer)       (None, 32, 120, 1)        0         
_________________________________________________________________
conv1_1 (Conv2D)             (None, 32, 120, 64)       2368      
_________________________________________________________________
max1 (MaxPooling2D)          (None, 16, 60, 64)        0         
_________________________________________________________________
conv2_1 (Conv2D)             (None, 16, 60, 128)       295040    
_________________________________________________________________
max2 (MaxPooling2D)          (None, 8, 30, 128)        0         
_________________________________________________________________
conv3_1 (Conv2D)             (None, 8, 30, 256)        295168    
_________________________________________________________________
conv3_2 (Conv2D)             (None, 8, 30, 256)        590080    
_________________________________________________________________
max3 (MaxPooling2D)          (None, 4, 30, 256)        0         
_________________________________________________________________
conv4_1 (Conv2D)             (None, 4, 30, 512)        1180160   
_________________________________________________________________
batch_normalization_1 (Batch (None, 4, 30, 512)        2048      
_________________________________________________________________
conv4_2 (Conv2D)             (None, 4, 30, 512)        2359808   
_________________________________________________________________
batch_normalization_2 (Batch (None, 4, 30, 512)        2048      
_________________________________________________________________
max4 (MaxPooling2D)          (None, 2, 30, 512)        0         
_________________________________________________________________
permute_1 (Permute)          (None, 512, 2, 30)        0         
_________________________________________________________________
reshape (Reshape)            (None, 30, 1024)          0         
_________________________________________________________________
bidirectional_1 (Bidirection (None, 30, 512)           1967616   
_________________________________________________________________
bidirectional_2 (Bidirection (None, 30, 512)           1181184   
_________________________________________________________________
dense2 (Dense)               (None, 30, 20)            10260     
_________________________________________________________________
softmax (Activation)         (None, 30, 20)            0         
=================================================================
Total params: 7,885,780
Trainable params: 7,883,732
Non-trainable params: 2,048
_________________________________________________________________
Super epoch 1/20
	-Trainning from 0 to 10000
	  Loss: 17.936

	-Trainning from 10000 to 20000
	  Loss: 11.444

	-Trainning from 20000 to 30000
	  Loss: 8.896

	-Trainning from 30000 to 40000
	  Loss: 6.679

	-Trainning from 40000 to 50000
	  Loss: 5.092

	-Trainning from 50000 to 60000
	  Loss: 3.950

	-Trainning from 60000 to 70000
	  Loss: 3.264

	-Trainning from 70000 to 80000
	  Loss: 2.797

	-Trainning from 80000 to 90000
	  Loss: 2.440

